Revit 2027 API
BuiltInFailures.SketchFailures.MutipleStairsPathInOneRunFailure Property
 Each stairs run can only have one stairs path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MutipleStairsPathInOneRunFailure { get; }
Public Shared ReadOnly Property MutipleStairsPathInOneRunFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MutipleStairsPathInOneRunFailure {
	FailureDefinitionId^ get ();
}
static member MutipleStairsPathInOneRunFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace